[
  {
    "_id": 1,
    "topic": "Web Development",
    "userName": "ReactJS",
    "time": "2h",
    "title": "React.js is a component based front end library that makes it very easy to build Single Page Applications or SPAs",
    "image": "/assets/reactjs-logo.png",
    "liked": true,
    "replies": 250,
    "retuits": 432,
    "likes": 2345,
    "handle": "@reactjs",
    "tuit": "Today, we’re thrilled to launch https://react.dev, the new home for React and its documentation. It teaches modern React with function components and Hooks, and we’ve included diagrams, illustrations, challenges, and over 600 interactive examples. Check it out!"
  },
  {
    "_id": 2,
    "topic": "",
    "userName": "JavaScript",
    "time": "1 day",
    "title": "JavaScript is programming language that can run on browsers as well as desktops",
    "image": "/assets/js-logo.png",
    "liked": false,
    "replies": 500,
    "retuits": 1069,
    "likes": 4513,
    "handle": "@javascript",
    "tuit": "A few weeks ago, you all told us your favorite code editor. VS Code won by a longshot. What's your favorite extension or shortcut for @code?"
  },
  {
    "_id": 3,
    "topic": "Web Development",
    "userName": "Ertiga",
    "title": "jQuery",
    "time": "last week",
    "image": "/assets/jquery-logo.png",
    "liked": true,
    "replies": 69,
    "retuits": 420,
    "likes": 1456,
    "handle": "@ertiga",
    "tuit": "create-next-app now asks if you want to start with Tailwind CSS instead of CSS Modules. Already out on canary, stable release soon! npx create-next-app@canary"
  },
  {
    "_id": 4,
    "topic": "Web Development",
    "userName": "NodeJS",
    "title": "",
    "time": "last month",
    "image": "/assets/nodejs-logo.png",
    "liked": false,
    "replies": 101,
    "retuits": 300,
    "likes": 10000,
    "handle": "@nodeJS",
    "tuit": "Over the last couple of days, users may have encountered intermittent 404 responses when accessing https://hubs.la/Q01Hpg4b0. We're confident that fixes have now been deployed that should resolve this. We apologize for any interruption this caused to your workflows."
  },
  {
    "_id": 5,
    "topic": "Space",
    "userName": "SpaceX",
    "time": "2h",
    "title": "Tesla Cybertruck lands on Mars and picks up the Curosity rover on its 6' bed",
    "image": "/assets/Tesla_logo.png",
    "liked": false,
    "replies": 204,
    "retuits": 561,
    "likes": 2000,
    "handle": "@spacex",
    "tuit": "You want to wake up in the morning and think the future is going to be great - and that’s what being a spacefaring civilization is all about. It’s about believing in the future and thinking that the future will be better than the past. And I can’t think of anything more exciting than going out there and being among the stars"
  }
]
